[
    {
        "id": 1,
        "name": "Class A",
        "code": "spectral.class.a",
        "class": "A",
        "color": "Light Blue",
        "surface_temp_min": 7500,
        "surface_temp_max": 10000,
        "luminosity_min": 2.93,
        "luminosity_max": 280000,
        "mass_min": 1.4,
        "mass_max": 15.8,
        "radius_min": 1,
        "radius_max": 273,
        "composition": "Hydrogen, some Ionized Metals",
        "image": "image\/stars\/starClassA.png",
        "info": "A Class A star is a stellar classification for stars composed of strong hydrogen and some ionized metals. These stars have spectra which are defined by strong hydrogen Balmer absorption lines. Generally referred to as being blue-white or light blue in color.<\/p>\nA-type stars don't have a convective zone and thus aren't expected to harbor a magnetic dynamo. As a consequence, because they don't have strong stellar winds they lack a means to generate X-ray emission.<\/p>"
    },
    {
        "id": 2,
        "name": "Class B",
        "code": "spectral.class.b",
        "class": "B",
        "color": "Blue",
        "surface_temp_min": 10000,
        "surface_temp_max": 28000,
        "luminosity_min": 52,
        "luminosity_max": 2280000,
        "mass_min": 2.1,
        "mass_max": 50.1,
        "radius_min": 1.81,
        "radius_max": 131,
        "composition": "Neutral Helium, some Hydrogen",
        "image": "image\/stars\/starClassB.png",
        "info": "A Class B star is a stellar classification for a hot blue star that is composed of neutral helium and some hydrogen. The temperature is between 10,000 and 28,000 Kelvins, generally referred to as being a blue star.<\/p>\nClass B stars don't have a corona and lack a convection zone in their outer atmosphere. They have a higher mass loss rate than smaller stars such as the Sun, and their stellar wind has velocities of about 3,000 km\/s. The energy generation in main-sequence Class B stars comes from the CNO cycle of thermonuclear fusion. Because the CNO cycle is very temperature sensitive, the energy generation is heavily concentrated at the center of the star, which results in a convection zone about the core. This results in a steady mixing of the hydrogen fuel with the helium byproduct of the nuclear fusion. Many Class B stars have a rapid rate of rotation, with an equatorial rotation velocity of about 200 km\/s.<\/p>"
    },
    {
        "id": 3,
        "name": "Class D",
        "code": "spectral.class.d",
        "class": "D",
        "color": "White",
        "surface_temp_min": 4000,
        "surface_temp_max": 150000,
        "luminosity_min": 6.73e-5,
        "luminosity_max": 6.91,
        "mass_min": 0.1,
        "mass_max": 1.1,
        "radius_min": 0.00696,
        "radius_max": 0.00944,
        "composition": "Variable",
        "image": "image\/stars\/whitedwarf.png",
        "info": "A white dwarf, is a stellar core remnant composed mostly of electron-degenerate matter. A white dwarf is very dense: its mass is comparable to that of the Sun, while its volume is comparable to that of Earth. A white dwarf's faint luminosity comes from the emission of stored thermal energy; no fusion takes place in a white dwarf wherein mass is converted to energy.<\/p>\nWhite dwarfs are thought to be the final evolutionary state of stars whose mass is not high enough to become a neutron star. After the hydrogen-fusing period of a main-sequence star of low or medium mass ends, such a star will expand to a red giant during which it fuses helium to carbon and oxygen in its core by the triple-alpha process. If a red giant has insufficient mass to generate the core temperatures required to fuse carbon (around 1 billion K), an inert mass of carbon and oxygen will build up at its center. After such a star sheds its outer layers and forms a planetary nebula, it will leave behind a core, which is the remnant white dwarf. Usually, white dwarfs are composed of carbon and oxygen. If the mass of the progenitor is between 8 and 10.5 solar masses, the core temperature will be sufficient to fuse carbon but not neon, in which case an oxygen-neon-magnesium white dwarf may form. Stars of very low mass will not be able to fuse helium, hence, a helium white dwarf may form by mass loss in binary systems.<\/p>\nThe material in a white dwarf no longer undergoes fusion reactions, so the star has no source of energy. As a result, it cannot support itself by the heat generated by fusion against gravitational collapse, but is supported only by electron degeneracy pressure, causing it to be extremely dense. The physics of degeneracy yields a maximum mass for a non-rotating white dwarf, the Chandrasekhar limit approximately 1.44 times of M beyond which it cannot be supported by electron degeneracy pressure. A carbon-oxygen white dwarf that approaches this mass limit, typically by mass transfer from a companion star, may explode as a type Ia supernova via a process known as carbon detonation.<\/p>\nA white dwarf is very hot when it forms, but because it has no source of energy, it will gradually cool as it radiates its energy. This means that its radiation, which initially has a high color temperature, will lessen and redden with time. Over a very long time, a white dwarf will cool and its material will begin to crystallize, starting with the core. The star's low temperature means it will no longer emit significant heat or light, and it will become a cold black dwarf. Because the length of time it takes for a white dwarf to reach this state is calculated to be longer than the current age of the universe (approximately 13.8 billion years), it is thought that no black dwarfs yet exist. The oldest white dwarfs still radiate at temperatures of a few thousand kelvins.<\/p>\nPlanets orbiting a Type D star have normally been cooked or evaporated during its red giant phase.<\/p>"
    },
    {
        "id": 4,
        "name": "Class F",
        "code": "spectral.class.f",
        "class": "F",
        "color": "White",
        "surface_temp_min": 6000,
        "surface_temp_max": 7500,
        "luminosity_min": 0.862,
        "luminosity_max": 473000,
        "mass_min": 0.9,
        "mass_max": 12.6,
        "radius_min": 0.71,
        "radius_max": 654,
        "composition": "Hydrogen and Ionized Metals, Calcium, and Iron",
        "image": "image\/stars\/starClassF.png",
        "info": "A Class F star is white and is made up of hydrogen and ionized metals. Also in the star there is calcium and iron.<\/p>"
    },
    {
        "id": 5,
        "name": "Class G",
        "code": "spectral.class.g",
        "class": "G",
        "color": "Yellow",
        "surface_temp_min": 5000,
        "surface_temp_max": 6000,
        "luminosity_min": 0.171,
        "luminosity_max": 1190000,
        "mass_min": 0.7,
        "mass_max": 12.5,
        "radius_min": 0.566,
        "radius_max": 2160,
        "composition": "Ionized Calcium, Neutral and Ionized Metals",
        "image": "image\/stars\/starClassG2.png",
        "info": "A Class G (or G-type) star is a stellar classification for stars composed of both neutral and ionized atoms of metallic substances, including ionized calcium. At its core a Class G star fuses hydrogen into helium, emitting in the neighborhood of 5,000 to 6,000 Kelvin, generally referred to as being yellow in color. G-type stars in the main sequence tend to be median in terms of absolute magnitude, and in the \"cooler\" half of the stellar classification system. Yellow G-type stars can range in size from yellow giants to the more diminutive yellow dwarf.<\/p>\nA G-type main-sequence star will fuse hydrogen for approximately 10 billion years, until it is exhausted at the center of the star. When this happens, the star expands to many times its previous size and becomes a red giant, such as Aldebaran (or Alpha Tauri). Eventually the red giant sheds its outer layers of gas, which become a planetary nebula, while the core rapidly cools and contracts into a compact, dense white dwarf.<\/p>"
    },
    {
        "id": 6,
        "name": "Class K",
        "code": "spectral.class.k",
        "class": "K",
        "color": "Orange",
        "surface_temp_min": 3500,
        "surface_temp_max": 5000,
        "luminosity_min": 0.0433,
        "luminosity_max": 1900000,
        "mass_min": 0.3,
        "mass_max": 15.8,
        "radius_min": 0.54,
        "radius_max": 3460,
        "composition": "Neutral Metals",
        "image": "image\/stars\/starClassK2.png",
        "info": "A Class K (K-type) main-sequence (hydrogen-burning) star in an intermediate size star between red M-type main-sequence stars (\"red dwarfs\") and yellow G-type main-sequence stars. They have masses between 0.5 and 0.8 times the mass of the Sun and surface temperatures between 3,900 and 5,200 K.<\/p>\nThese stars are of particular interest in the search for life because they are stable on the main sequence for a very long time (15 to 70 billion years, compared to 10 billion for the Sun). Like M-type stars, they tend to have a very small mass, leading to their extremely long lifespan that offers plenty of time for life to develop on orbiting Earth-like, terrestrial planets. In addition, K-type stars emit less ultraviolet radiation (which can damage DNA and thus hamper the emergence of nucleic acid based life) than G-type stars like the Sun. K-type main-sequence stars are also about three to four times as abundant as G-type main-sequence stars, making planet searches easier. While M-type stars are also very abundant, they are more likely to have tidally locked planets in orbit and are more prone to produce solar flares that would more easily strike nearby rocky planets, making it much harder for life to develop. Due to their greater heat, the habitable zones of K-type stars are also much wider than those of M-type stars.<\/p>"
    },
    {
        "id": 7,
        "name": "Class M",
        "code": "spectral.class.m",
        "class": "M",
        "color": "Red",
        "surface_temp_min": 2500,
        "surface_temp_max": 3500,
        "luminosity_min": 0.00163,
        "luminosity_max": 711000000,
        "mass_min": 0.1,
        "mass_max": 15.8,
        "radius_min": 0.2,
        "radius_max": 231000,
        "composition": "Ionized Atoms, Helium",
        "image": "image\/stars\/starClassM.png",
        "info": "Class M stars are by far the most common. About 76% of the main-sequence stars in the solar neighborhood are class M stars. However, class M main-sequence stars (red dwarfs) have such low luminosities that none are bright enough to be seen with the unaided eye, unless under exceptional conditions. The brightest known M-class main-sequence star is M0V Lacaille 8760, with magnitude 6.6 (the limiting magnitude for typical naked-eye visibility under good conditions is typically quoted as 6.5), and it is extremely unlikely that any brighter examples will be found.<\/p>\nAlthough most class M stars are red dwarfs, most of the largest ever supergiant stars in the Milky Way are M stars, such as VY Canis Majoris, Antares and Betelgeuse, which are also class M. Furthermore, the larger, hotter brown dwarfs are late class M, usually in the range of M6.5 to M9.5.<\/p>\nThe spectrum of a class M star contains lines from oxide molecules (in the visible spectrum, especially TiO) and all neutral metals, but absorption lines of hydrogen are usually absent. TiO bands can be strong in class M stars, usually dominating their visible spectrum by about M5. Vanadium(II) oxide bands become present by late M.<\/p>\nRed giants in the main sequence have often cooked or disintegrated their previous inner planets.<\/p>"
    },
    {
        "id": 8,
        "name": "Class O",
        "code": "spectral.class.o",
        "class": "O",
        "color": "Violet",
        "surface_temp_min": 28000,
        "surface_temp_max": 50000,
        "luminosity_min": 33100,
        "luminosity_max": 34100000,
        "mass_min": 6.7,
        "mass_max": 160,
        "radius_min": 6.85,
        "radius_max": 80.5,
        "composition": "Ionized Atoms, Helium",
        "image": "image\/stars\/starClassO.png",
        "info": "A Class O (or O-type) star is a stellar classification for stars composed of ionized atoms, especially helium, emitting high amounts of ultraviolet radiation, generally referred to as being blue-violet or dark blue in color. O-type stars in the main sequence tend to be extremely hot in temperature (in the neighborhood of 28,000 to 50,000 Kelvin) and bright in terms of absolute magnitude, the \"dark\" and \"violet\" descriptors of their name are as such because of the large output of non-visible heat radiation.<\/p>\nClass O stars do not live long enough to form a planetary system and are usually surrounded by a dust cloud.<\/p>"
    }
]
